IdeaRS.OpenModel.Detail.EdgeOrientationType
Edge position type

IdeaRS.OpenModel.Detail.EdgeOrientationType.FromBegin
Distance measured from the beginning of edge

IdeaRS.OpenModel.Detail.EdgeOrientationType.FromEnd
Distance measured from the end of edge